package lesson_14.utill;

import java.util.List;
import java.util.Random;

public class FullNameUtill {
    private static final List<String> NAMES = List.of("Авдей",
            "Авксентий", "Агапит", "Агафон",
            "Акакий", "Александр", "Алексей", "Альберт", "Альвиан", "Анатолий", "Аникита",
            "Антон", "Антонин", "Анфим", "Аристарх", "Аркадий",
            "Арсений", "Артём", "Артемий", "Артур", "Архипп", "Афанасий",
            "Вавила", "Вадим", "Валентин", "Валерий", "Валерьян", "Варлам", "Варсонофий", "Варфоломей", "Василий",
            "Венедикт", "Вениамин", "Викентий", "Виктор", "Виссарион", "Виталий", "Владимир", "Владислав", "Владлен", "Влас",
            "Всеволод", "Вячеслав", "Магистриан",
            "Макар", "Максим", "Мамонт", "Марк", "Мартын", "Матвей", "Мелентий", "Мина",
            "Мирон", "Мирослав", "Митрофан", "Михаил", "Мстислав", "Павел", "Паисий", "Панкратий",
            "Пантелеймон", "Парфений", "Пафнутий", "Пахомий", "Пётр", "Платон", "Поликарп",
            "Порфирий", "Потап", "Пров", "Прокопий", "Протасий", "Прохор", "Фаддей", "Фёдор", "Федосей",
            "Федот", "Феликс", "Феоктист", "Филат", "Филимон", "Филипп", "Фирс", "Фока", "Фома",
            "Фотий", "Фрол", "Данакт", "Даниил",
            "Демид", "Демьян", "Денис", "Дмитрий", "Добрыня",
            "Донат", "Дорофей", "Емельян", "Еремей", "Ермолай", "Ерофей", "Ефим", "Ефрем");
    private static final List<String> SURNAME = List.of("Сидоров", "Казаков",
            "Карасёв", "Карпов", "Катаев", "Кобелев", "Козлов",
            "Комиссаров", "Кондаков", "Кузнецов", "Сабуров",
            "Сартаков", "Семиколенных", "Семичастнов",
            "Строгальщиков", "Бабурин", "Бабуркин", "Баранов", "Бараш", "Бахтин",
            "Бердюгин", "Бессонов", "Боборыкин", "Боталов", "", "Юдин", "Юмашев", "Юферев", "Шишкин",
            "Шишов");
    private static final List<String> PATRONYMIC = List.of("Анатольевич","Антонович","Архиппович","Демидович",
            "Прович","Маркович","Аркадьевич","Дмитриевич","Максимович","Валерьевич","Алексеевич","Амирович");

    public static String randomName() {
        return randomizer(NAMES);
    }

    public static String randomSurname() {
        return randomizer(SURNAME);
    }

    public static String randomPatronymic() {
        return randomizer(PATRONYMIC);
    }

    private static String randomizer(List<String> value) {
        return value.get(new Random().nextInt(value.size()));
    }

}
